// 1.Даны переменные a и b. Проверьте, что a делится без остатка на b.

//var a = 9;
//var b = 2;
//var equals = a % b;
//if (equals != 0) {
//console.log('Делится с остатком =' + equals);
//} else {
//	console.log('Делится =' + (a / b));
//}


//2. "нарисуйте" в консоли прямоугольный треугольник.

//let a = prompt('Значение 1:', ['Введите размер треугольника']); 
//let b = " "; 
//let  c= prompt('Значение 2:', ['Введите символ(*)']); 
  
//function drawTriangle (a, c) {   
//b = "";                                                      
//for (var d = 0; d < a; d++){      
//console.log(b += c);}} 
                                                          
//drawTriangle (a, c); 


//3. Выведите столбец нечетных чисел в промежутке от 0 до 100.

//for (a=0; a<=100;a++){
//if (a % 2 === 0) {continue;}
//console.log('Нечетные a='+a);
//}


//4.Дано число n = 1000. Делите его на 2 столько раз, пока результат
//деления не станет меньше 50. Какое число получится?

//var a = 1000;
//var b = 0;
//while (a >= 50){a=a/2;b++}
//console.log('Количество итераций =' + b);
//console.log('Число получится =' + a);



